; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-7-295)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p6-1 - location
	p6-5 - location
	p4-0 - location
	p4-2 - location
	p4-5 - location
	p5-0 - location
	p5-1 - location
	p0-6 - location
	p3-4 - location
	p3-5 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s1)
	(at package2 s5)
	(at package3 s2)
	(at package4 s3)
	(at package5 s2)
	(at package6 s6)
	(at package7 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 33)
	(= (time-to-walk p6-1 s6) 33)
	(= (time-to-walk s1 p6-1) 20)
	(= (time-to-walk p6-1 s1) 20)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 23)
	(= (time-to-walk p6-5 s6) 23)
	(= (time-to-walk s5 p6-5) 36)
	(= (time-to-walk p6-5 s5) 36)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 22)
	(= (time-to-walk p4-0 s4) 22)
	(= (time-to-walk s0 p4-0) 25)
	(= (time-to-walk p4-0 s0) 25)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 12)
	(= (time-to-walk p4-2 s4) 12)
	(= (time-to-walk s2 p4-2) 9)
	(= (time-to-walk p4-2 s2) 9)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 30)
	(= (time-to-walk p4-5 s4) 30)
	(= (time-to-walk s5 p4-5) 15)
	(= (time-to-walk p4-5 s5) 15)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 27)
	(= (time-to-walk p5-0 s5) 27)
	(= (time-to-walk s0 p5-0) 9)
	(= (time-to-walk p5-0 s0) 9)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 13)
	(= (time-to-walk p5-1 s5) 13)
	(= (time-to-walk s1 p5-1) 19)
	(= (time-to-walk p5-1 s1) 19)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 7)
	(= (time-to-walk p0-6 s0) 7)
	(= (time-to-walk s6 p0-6) 13)
	(= (time-to-walk p0-6 s6) 13)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 3)
	(= (time-to-walk p3-4 s3) 3)
	(= (time-to-walk s4 p3-4) 26)
	(= (time-to-walk p3-4 s4) 26)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 27)
	(= (time-to-walk p3-5 s3) 27)
	(= (time-to-walk s5 p3-5) 34)
	(= (time-to-walk p3-5 s5) 34)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 13)
	(= (time-to-drive s2 s6) 13)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 39)
	(= (time-to-drive s3 s6) 39)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 9)
	(= (time-to-drive s4 s6) 9)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 5)
	(= (time-to-drive s4 s0) 5)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 37)
	(= (time-to-drive s5 s0) 37)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 9)
	(= (time-to-drive s6 s0) 9)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 8)
	(= (time-to-drive s2 s1) 8)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 22)
	(= (time-to-drive s3 s1) 22)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 27)
	(= (time-to-drive s4 s1) 27)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 6)
	(= (time-to-drive s6 s1) 6)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 37)
	(= (time-to-drive s1 s5) 37)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 33)
	(= (time-to-drive s3 s5) 33)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 22)
	(= (time-to-drive s6 s5) 22)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 28)
	(= (time-to-drive s0 s3) 28)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 37)
	(= (time-to-drive s5 s2) 37)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s5)
	(at driver3 s0)
	(at truck2 s3)
	(at package1 s2)
	(at package2 s3)
	(at package3 s6)
	(at package4 s4)
	(at package5 s0)
	(at package6 s0)
	(at package7 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 10
2. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 280
   goals met: 1 of 10
3. (walk driver2 s1 p5-1)
   deleted: (at driver2 s1)
   added: (at driver2 p5-1)
   goals met: 1 of 10
4. (load-truck package7 truck2 s0)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 10
5. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 280 to 588
   goals met: 2 of 10
6. (load-truck package4 truck2 s3)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 10
7. (walk driver2 p5-1 s5)
   deleted: (at driver2 p5-1)
   added: (at driver2 s5)
   goals met: 3 of 10
8. (drive-truck truck2 s3 s6 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (fuel-used) from 588 to 1095
   goals met: 2 of 10
9. (load-truck package6 truck2 s6)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 10
10. (drive-truck truck2 s6 s2 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (fuel-used) from 1095 to 1303
   goals met: 2 of 10
11. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 2 of 10
12. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 1303 to 2043
   goals met: 2 of 10
13. (load-truck package2 truck2 s5)
   deleted: (at package2 s5)
   added: (in package2 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 2 of 10
14. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 2043 to 2593
   goals met: 2 of 10
15. (unload-truck package3 truck2 s6)
   deleted: (in package3 truck2)
   added: (at package3 s6)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 3 of 10
16. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2593 to 2713
   goals met: 3 of 10
17. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 10
18. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 2713 to 2913
   goals met: 3 of 10
19. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 3 of 10
20. (unload-truck package1 truck2 s2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 4 of 10
21. (drive-truck truck2 s2 s6 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 2913 to 3238
   goals met: 4 of 10
22. (drive-truck truck2 s6 s3 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 3238 to 4213
   goals met: 5 of 10
23. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 10
24. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 4213 to 4773
   goals met: 5 of 10
25. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 6 of 10
26. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 7 of 10
27. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 4773 to 4838
   goals met: 7 of 10
28. (unload-truck package4 truck2 s4)
   deleted: (in package4 truck2)
   added: (at package4 s4)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 10
29. (unload-truck package7 truck2 s4)
   deleted: (in package7 truck2)
   added: (at package7 s4)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 10
30. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 4838 to 5108
   goals met: 9 of 10
31. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 5108 to 5328
   goals met: 10 of 10
